# Contents
### 1. Import libraries
### 2. Import customer.csv
### 3. Wrangle customer df
### 4. Consistancy checks
### 5. Combine customer data with rest of prepared data
### 6. Merge dfp with dfc on 'user_id'
### 7. Export new dataframe

# 1. Import libraries

In [1]:
#Import Libraries

import pandas as pd
import numpy as np
import os

# 2. Import customer.csv

In [2]:
# Creating path to data folder

path = r'C:\Documents\Career Foundry\Python\Instacart Basket Analysis\02 Data'

In [3]:
path

'C:\\Documents\\Career Foundry\\Python\\Instacart Basket Analysis\\02 Data'

In [4]:
# Import Data

dfc = pd.read_csv(os.path.join (path, 'Original Data', 'customers.csv'), index_col = False)

# 3. Wrangle customer df

In [5]:
dfc

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...,...
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

In [6]:
# Rename 'Surnam' to 'Surname'

dfc.rename(columns = {'Surnam' : 'Surname'}, inplace = True)

In [7]:
dfc.head()

,user_id,First Name,Surname,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
# Rename 'STATE' to 'State'

dfc.rename(columns = {'STATE' : 'State'}, inplace = True)

In [9]:
dfc.head()

,user_id,First Name,Surname,Gender,State,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
# Rename 'n_dependants' to 'dependants'

dfc.rename(columns = {'n_dependants' : 'dependants'}, inplace = True)

In [11]:
dfc.head()

,user_id,First Name,Surname,Gender,State,Age,date_joined,dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [12]:
dfc.dtypes

user_id         int64
First Name     object
Surname        object
Gender         object
State          object
Age             int64
date_joined    object
dependants      int64
fam_status     object
income          int64
dtype: object

In [13]:
# change type of 'user_id' to object because it doesn't need to be manipulated as a number

dfc['user_id'] = dfc['user_id'].astype ('str')

In [14]:
dfc['user_id'].dtype

dtype('O')

In [15]:
dfc.describe()

                 Age     dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [16]:
dfc.shape

(206209, 10)

## 4. Consistancy checks

In [17]:
dfc.shape

(206209, 10)

In [18]:
# Check for mixed types

for col in dfc.columns.tolist():
  weird = (dfc[[col]].applymap(type) != dfc[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (dfc[weird]) > 0:
    print (col)

First Name

In [19]:
# change 'First Name' to str

dfc['First Name'] = dfc['First Name'].astype('str')

In [20]:
# Check for mixed types

for col in dfc.columns.tolist():
  weird = (dfc[[col]].applymap(type) != dfc[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (dfc[weird]) > 0:
    print (col)

In [21]:
dfc['First Name'].dtype

dtype('O')

In [22]:
dfc.head(30)

,user_id,First Name,Surname,Gender,State,Age,date_joined,dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072
10,26441,Gloria,Stafford,Female,Nevada,19,1/1/2017,2,living with parents and siblings,43443
11,33835,Roger,Casey,Male,Nebraska,45,1/1/2017,2,married,47988
12,75032,Cynthia,Mcdaniel,Female,Georgia,75,1/1/2017,1,married,57835
13,51,Stephanie,Jensen,Female,Wyoming,37,1/1/2017,1,married,71190
14,516,Peter,Hunt,Male,Colorado,51,1/1/2017,2,married,146559
15,6965,Brandon,Mata,Male,North Dakota,70,1/1/2017,0,divorced/widowed,100091
16,8794,Amy,Mack,Female,Nebraska,30,1/1/2017,3,married,57096
17,9944,Brian,Oneill,Male,Wisconsin,26,1/1/2017,1,married,91826
18,13313,Victor,Moss,Male,Alaska,31,1/1/2017,2,married,91111
19,17335,Patrick,Fowler,Male,Vermont,65,1/1/2017,1,married,34514
20,29864,Randy,Mills,Male,North Dakota,39,1/1/2017,1,married,44364
21,37744,Wanda,Salas,Female,Arkansas,77,1/1/2017,1,married,125977
22,50000,Sandra,Trejo,Female,Maine,64,1/1/2017,2,married,115489
23,55567,Martha,Hurst,Female,North Carolina,67,1/1/2017,2,married,48645
24,57549,Shawn,Moore,Male,Montana,72,1/1/2017,0,divorced/widowed,135302
25,60386,Wayne,Woodward,Male,Alaska,59,1/1/2017,2,married,136778
26,68032,Charles,Stevenson,Male,West Virginia,74,1/1/2017,2,married,34992
27,83910,Ruth,Rice,Female,Indiana,70,1/1/2017,1,married,165147
28,86936,Kimberly,Monroe,Female,Oregon,57,1/1/2017,3,married,44967
29,99199,Kimberly,Monroe,Female,Arkansas,80,1/1/2017,0,divorced/widowed,138075

In [29]:
dfc['Age'].value_counts(dropna=False)

19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: Age, Length: 64, dtype: int64

In [23]:
dfc['Age'].agg(['mean', 'min', 'max'])

mean    49.501646
min     18.000000
max     81.000000
Name: Age, dtype: float64

In [39]:
# lower the amount of memory numeric columns use
def lm(dfc):

    fcols = dfc.select_dtypes('float').columns
    icols = dfc.select_dtypes('integer').columns

    dfc[fcols] = dfc[fcols].apply(pd.to_numeric, downcast='float')
    dfc[icols] = dfc[icols].apply(pd.to_numeric, downcast='integer')
    
    return dfc

In [40]:
result = lm(dfc)

In [42]:
print(result.dtypes)

user_id        object
First Name     object
Surname        object
Gender         object
State          object
Age              int8
date_joined    object
dependants       int8
fam_status     object
income          int32
dtype: object

In [43]:
dfc = result

In [44]:
dfc.head()

,user_id,First Name,Surname,Gender,State,Age,date_joined,dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [45]:
print (dfc.dtypes)

user_id        object
First Name     object
Surname        object
Gender         object
State          object
Age              int8
date_joined    object
dependants       int8
fam_status     object
income          int32
dtype: object

In [38]:
dfc['Age'].agg(['mean', 'min', 'max'])

mean    49.501646
min     18.000000
max     81.000000
Name: Age, dtype: float64

In [32]:
dfc['date_joined'].value_counts(dropna=False)

9/17/2018     213
2/10/2018     212
9/21/2019     211
4/1/2019      211
12/19/2017    210
             ...
9/1/2018      141
1/22/2018     140
11/24/2017    139
7/18/2019     138
8/6/2018      128
Name: date_joined, Length: 1187, dtype: int64

In [48]:
dfc['date_joined'].agg(['mean', 'min', 'max'])

min    1/1/2017
max    9/9/2019
Name: date_joined, dtype: object

In [49]:
dfc['dependants'].value_counts(dropna=False)

0    51602
3    51594
1    51531
2    51482
Name: dependants, dtype: int64

In [35]:
dfc['fam_status'].value_counts(dropna=False)

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: fam_status, dtype: int64

In [50]:
dfc['income'].value_counts(dropna=False)

95891     10
57192     10
95710     10
94809      9
97532      9
          ..
139481     1
152861     1
464181     1
228664     1
28658      1
Name: income, Length: 108012, dtype: int64

In [38]:
# find empty observations

dfc.isnull().sum()

user_id        0
First Name     0
Surname        0
Gender         0
State          0
Age            0
date_joined    0
dependants     0
fam_status     0
income         0
dtype: int64

### No null values

In [51]:
# create subset with only rows that are complete duplicates

df_dups = dfc[dfc.duplicated()]

In [52]:
df_dups.shape

(0, 10)

### No duplicates

# 5. Combine customer data with rest of prepared data

In [53]:
# Importing prepped data

dfp = pd.read_pickle(os.path.join(path, 'Prepped Data', 'ords_prods_merged.pkl'))

In [59]:
# lower the amount of memory numeric columns use
def lm(dfp):

    fcols = dfp.select_dtypes('float').columns
    icols = dfp.select_dtypes('integer').columns

    dfp[fcols] = dfp[fcols].apply(pd.to_numeric, downcast='float')
    dfp[icols] = dfp[icols].apply(pd.to_numeric, downcast='integer')
    
    return dfp

In [60]:
result = lm(dfp)

In [61]:
dfp = result

In [62]:
dfp.dtypes

order_id                    int32
user_id                     int32
order_number                 int8
orders_day_of_week           int8
order_hour_of_day            int8
days_since_prior_order    float32
product_id                  int32
add_to_cart_order           int16
reordered                    int8
product_name               object
aisle_id                    int16
department_id                int8
prices                    float32
price_range_loc            object
busiest_day                object
busiest_days               object
busiest_period_of_day      object
max_order                    int8
loyalty_flag               object
user_price_mean           float32
spending_flag              object
med_days_since            float32
Order freq                 object
dtype: object

In [63]:
dfp.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,user_price_mean,spending_flag,med_days_since,Order freq
0,2539329,1,1,2,8,0.0,196,1,0,Soda,...,Mid-range product,Regularly busy,Regularly busy days,Average orders,10,New customer,6.367796,Low spender,18.542374,Regular customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Least busy days,Average orders,10,New customer,6.367796,Low spender,18.542374,Regular customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Least busy days,Most orders,10,New customer,6.367796,Low spender,18.542374,Regular customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Mid-range product,Least busy,Least busy days,Average orders,10,New customer,6.367796,Low spender,18.542374,Regular customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Mid-range product,Least busy,Least busy days,Most orders,10,New customer,6.367796,Low spender,18.542374,Regular customer

In [49]:
dfc.head()

,user_id,First Name,Surname,Gender,State,Age,date_joined,dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [64]:
dfp.shape

(32403007, 23)

In [65]:
dfc.shape

(206209, 10)

# 6. Merge dfp with dfc on 'user_id'

In [66]:
dfp['user_id'].dtype

dtype('int32')

In [67]:
# change type of dfp['user_id'] to object to match type of dfc['user_id'] so can merge on it

dfp['user_id'] = dfp['user_id'].astype ('str')

In [68]:
dfp['user_id'].dtype

dtype('O')

In [73]:
# Save dfc before merge

dfc.to_pickle(os.path.join(path, 'Prepped Data', 'dfc.pkl'))

In [75]:
# Save dfp before merge

dfp.to_pickle(os.path.join(path, 'Prepped Data', 'dfp.pkl'))

In [76]:
# Merge dfp with dfc on 'user_id'

dfm = dfp.merge(dfc, on = ['user_id'], how = 'left', indicator = True)

# 7. Export new dataframe

In [77]:
# Save new merged df (dfm) to pkl

dfm.to_pickle(os.path.join(path, 'Prepped Data', 'dfm.pkl'))